{
    "projects": [{
        "title": "Phonebook",
        "description": "Language that we used is java, data structure that we use is linkedlist. Basically this is just like a phonebook that store data such as phone number and name. I remember we just use txt as database."},
        {
        "title": "Survey Form",
        "description": "this is the project in freecodecamp to get the certification"},
        {
        "title": "Tribute Page",
        "description": "this is the project in freecodecamp to get the certification"},
        {
        "title": "Technical Documentation",
        "description": "this is the project in freecodecamp to get the certification"},
        {
        "title": "Landing page",
        "description": "this is the project in freecodecamp to get the certification"},
        {
        "title": "Alumni Tracking System",
        "description": "This is the first website project during my college year, the goal of this project is to track the alumni if their work is aligned with the course that they took."},
        {
        "title": "Role Playing Game",
        "description": "This project is part of my freecodecamp journey learning data structure and algorithm, this is just basic html, css and javascript"},
        {
        "title": "Luhn Algorithm",
        "description": "This project is part of my freecodecamp journey learning data structure and algorithm, this is the same as salt and pepper."},
        {
        "title": "Expense Tracker",
        "description": "This project is part of my freecodecamp journey learning data structure and algorithm, I just use javascript here no css and html."},
        {
        "title": "Password Generator",
        "description": "I don't much remember this project, but as title says password generator. looking back again with this project I wonder why I didn't use regex"},
        {
        "title": "Guessing Game",
        "description": "This game will generate a random number from 1 to 100, then you need to guess that number, if your guess number is higher than the target number it will say higher else another way around. TLDR the logic is same as binary search."},
        {
        "title": "Trait Reroll",
        "description": "This is a gatcha trait reroll for a character"},
        {
        "title": "Temperature Conversion",
        "description": "jus a conversion from Celsius to Fahrenheit and vice versa"},
        {
        "title": "Hotel API",
        "description": "Just setting up an API using microsoft VScode and C#"},
        {
        "title": "UniAR: Uniform Fitting Kiosk using Augmented Reality",
        "description": "This our capstone, we use python as language. The objective of our capstone is to eliminate the long queue, and manually fitting that can cause unpleasant smells."}
]}
